zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
#define ENETC_PSI_SIMR_DEFAULT_RX_GROUP_MASK     (0x10000U)
#define ENETC_PSI_SIMR_DEFAULT_RX_GROUP_SHIFT    (16U)
#define ENETC_PSI_SIMR_DEFAULT_RX_GROUP_WIDTH    (1U)
#define ENETC_PSI_SIMR_DEFAULT_RX_GROUP(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIMR_DEFAULT_RX_GROUP_SHIFT)) & ENETC_PSI_SIMR_DEFAULT_RX_GROUP_MASK)

#define ENETC_PSI_SIMR_EN_MASK                   (0x80000000U)
#define ENETC_PSI_SIMR_EN_SHIFT                  (31U)
#define ENETC_PSI_SIMR_EN_WIDTH                  (1U)
#define ENETC_PSI_SIMR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIMR_EN_SHIFT)) & ENETC_PSI_SIMR_EN_MASK)
/*! @} */

/*! @name SISR - Station interface status register */
/*! @{ */

#define ENETC_PSI_SISR_TX_BUSY_MASK              (0x1U)
#define ENETC_PSI_SISR_TX_BUSY_SHIFT             (0U)
#define ENETC_PSI_SISR_TX_BUSY_WIDTH             (1U)
#define ENETC_PSI_SISR_TX_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SISR_TX_BUSY_SHIFT)) & ENETC_PSI_SISR_TX_BUSY_MASK)

#define ENETC_PSI_SISR_MAC_UP_MASK               (0x2U)
#define ENETC_PSI_SISR_MAC_UP_SHIFT              (1U)
#define ENETC_PSI_SISR_MAC_UP_WIDTH              (1U)
#define ENETC_PSI_SISR_MAC_UP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SISR_MAC_UP_SHIFT)) & ENETC_PSI_SISR_MAC_UP_MASK)

#define ENETC_PSI_SISR_MAC_MP_MASK               (0x4U)
#define ENETC_PSI_SISR_MAC_MP_SHIFT              (2U)
#define ENETC_PSI_SISR_MAC_MP_WIDTH              (1U)
#define ENETC_PSI_SISR_MAC_MP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SISR_MAC_MP_SHIFT)) & ENETC_PSI_SISR_MAC_MP_MASK)

#define ENETC_PSI_SISR_VLAN_P_MASK               (0x8U)
#define ENETC_PSI_SISR_VLAN_P_SHIFT              (3U)
#define ENETC_PSI_SISR_VLAN_P_WIDTH              (1U)
#define ENETC_PSI_SISR_VLAN_P(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SISR_VLAN_P_SHIFT)) & ENETC_PSI_SISR_VLAN_P_MASK)

#define ENETC_PSI_SISR_VLAN_UTA_MASK             (0x10U)
#define ENETC_PSI_SISR_VLAN_UTA_SHIFT            (4U)
#define ENETC_PSI_SISR_VLAN_UTA_WIDTH            (1U)
#define ENETC_PSI_SISR_VLAN_UTA(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SISR_VLAN_UTA_SHIFT)) & ENETC_PSI_SISR_VLAN_UTA_MASK)
/*! @} */

/*! @name SICTR0 - Station interface current time register 0 */
/*! @{ */

#define ENETC_PSI_SICTR0_CURR_TIME_MASK          (0xFFFFFFFFU)
#define ENETC_PSI_SICTR0_CURR_TIME_SHIFT         (0U)
#define ENETC_PSI_SICTR0_CURR_TIME_WIDTH         (32U)
#define ENETC_PSI_SICTR0_CURR_TIME(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICTR0_CURR_TIME_SHIFT)) & ENETC_PSI_SICTR0_CURR_TIME_MASK)
/*! @} */

/*! @name SICTR1 - Station interface current time register 1 */
/*! @{ */

#define ENETC_PSI_SICTR1_CURR_TIME_MASK          (0xFFFFFFFFU)
#define ENETC_PSI_SICTR1_CURR_TIME_SHIFT         (0U)
#define ENETC_PSI_SICTR1_CURR_TIME_WIDTH         (32U)
#define ENETC_PSI_SICTR1_CURR_TIME(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICTR1_CURR_TIME_SHIFT)) & ENETC_PSI_SICTR1_CURR_TIME_MASK)
/*! @} */

/*! @name SIPCAPR0 - Station interface port capability register 0 */
/*! @{ */

#define ENETC_PSI_SIPCAPR0_RSC_MASK              (0x1U)
#define ENETC_PSI_SIPCAPR0_RSC_SHIFT             (0U)
#define ENETC_PSI_SIPCAPR0_RSC_WIDTH             (1U)
#define ENETC_PSI_SIPCAPR0_RSC(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_RSC_SHIFT)) & ENETC_PSI_SIPCAPR0_RSC_MASK)

#define ENETC_PSI_SIPCAPR0_LSO_MASK              (0x2U)
#define ENETC_PSI_SIPCAPR0_LSO_SHIFT             (1U)
#define ENETC_PSI_SIPCAPR0_LSO_WIDTH             (1U)
#define ENETC_PSI_SIPCAPR0_LSO(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_LSO_SHIFT)) & ENETC_PSI_SIPCAPR0_LSO_MASK)

#define ENETC_PSI_SIPCAPR0_RFS_MASK              (0x4U)
#define ENETC_PSI_SIPCAPR0_RFS_SHIFT             (2U)
#define ENETC_PSI_SIPCAPR0_RFS_WIDTH             (1U)
#define ENETC_PSI_SIPCAPR0_RFS(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_RFS_SHIFT)) & ENETC_PSI_SIPCAPR0_RFS_MASK)

#define ENETC_PSI_SIPCAPR0_FP_MASK               (0x8U)
#define ENETC_PSI_SIPCAPR0_FP_SHIFT              (3U)
#define ENETC_PSI_SIPCAPR0_FP_WIDTH              (1U)
#define ENETC_PSI_SIPCAPR0_FP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_FP_SHIFT)) & ENETC_PSI_SIPCAPR0_FP_MASK)

#define ENETC_PSI_SIPCAPR0_TGS_MASK              (0x10U)
#define ENETC_PSI_SIPCAPR0_TGS_SHIFT             (4U)
#define ENETC_PSI_SIPCAPR0_TGS_WIDTH             (1U)
#define ENETC_PSI_SIPCAPR0_TGS(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_TGS_SHIFT)) & ENETC_PSI_SIPCAPR0_TGS_MASK)

#define ENETC_PSI_SIPCAPR0_TSD_MASK              (0x20U)
#define ENETC_PSI_SIPCAPR0_TSD_SHIFT             (5U)
#define ENETC_PSI_SIPCAPR0_TSD_WIDTH             (1U)
#define ENETC_PSI_SIPCAPR0_TSD(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_TSD_SHIFT)) & ENETC_PSI_SIPCAPR0_TSD_MASK)

#define ENETC_PSI_SIPCAPR0_CBS_MASK              (0x40U)
#define ENETC_PSI_SIPCAPR0_CBS_SHIFT             (6U)
#define ENETC_PSI_SIPCAPR0_CBS_WIDTH             (1U)
#define ENETC_PSI_SIPCAPR0_CBS(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_CBS_SHIFT)) & ENETC_PSI_SIPCAPR0_CBS_MASK)

#define ENETC_PSI_SIPCAPR0_RSS_MASK              (0x100U)
#define ENETC_PSI_SIPCAPR0_RSS_SHIFT             (8U)
#define ENETC_PSI_SIPCAPR0_RSS_WIDTH             (1U)
#define ENETC_PSI_SIPCAPR0_RSS(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_RSS_SHIFT)) & ENETC_PSI_SIPCAPR0_RSS_MASK)

#define ENETC_PSI_SIPCAPR0_PSFP_MASK             (0x200U)
#define ENETC_PSI_SIPCAPR0_PSFP_SHIFT            (9U)
#define ENETC_PSI_SIPCAPR0_PSFP_WIDTH            (1U)
#define ENETC_PSI_SIPCAPR0_PSFP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_PSFP_SHIFT)) & ENETC_PSI_SIPCAPR0_PSFP_MASK)

#define ENETC_PSI_SIPCAPR0_IPFLT_MASK            (0x400U)
#define ENETC_PSI_SIPCAPR0_IPFLT_SHIFT           (10U)
#define ENETC_PSI_SIPCAPR0_IPFLT_WIDTH           (1U)
#define ENETC_PSI_SIPCAPR0_IPFLT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_IPFLT_SHIFT)) & ENETC_PSI_SIPCAPR0_IPFLT_MASK)

#define ENETC_PSI_SIPCAPR0_RP_MASK               (0x800U)
#define ENETC_PSI_SIPCAPR0_RP_SHIFT              (11U)
#define ENETC_PSI_SIPCAPR0_RP_WIDTH              (1U)
#define ENETC_PSI_SIPCAPR0_RP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_RP_SHIFT)) & ENETC_PSI_SIPCAPR0_RP_MASK)

#define ENETC_PSI_SIPCAPR0_WO_MASK               (0x2000U)
#define ENETC_PSI_SIPCAPR0_WO_SHIFT              (13U)
#define ENETC_PSI_SIPCAPR0_WO_WIDTH              (1U)
#define ENETC_PSI_SIPCAPR0_WO(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_WO_SHIFT)) & ENETC_PSI_SIPCAPR0_WO_MASK)

#define ENETC_PSI_SIPCAPR0_FS_MASK               (0x10000U)
#define ENETC_PSI_SIPCAPR0_FS_SHIFT              (16U)
#define ENETC_PSI_SIPCAPR0_FS_WIDTH              (1U)
#define ENETC_PSI_SIPCAPR0_FS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR0_FS_SHIFT)) & ENETC_PSI_SIPCAPR0_FS_MASK)
/*! @} */

/*! @name SIPCAPR1 - Station interface port capability register 1 */
/*! @{ */

#define ENETC_PSI_SIPCAPR1_NUM_TCS_MASK          (0x70U)
#define ENETC_PSI_SIPCAPR1_NUM_TCS_SHIFT         (4U)
#define ENETC_PSI_SIPCAPR1_NUM_TCS_WIDTH         (3U)
#define ENETC_PSI_SIPCAPR1_NUM_TCS(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR1_NUM_TCS_SHIFT)) & ENETC_PSI_SIPCAPR1_NUM_TCS_MASK)

#define ENETC_PSI_SIPCAPR1_NUM_MCH_MASK          (0x300U)
#define ENETC_PSI_SIPCAPR1_NUM_MCH_SHIFT         (8U)
#define ENETC_PSI_SIPCAPR1_NUM_MCH_WIDTH         (2U)
#define ENETC_PSI_SIPCAPR1_NUM_MCH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR1_NUM_MCH_SHIFT)) & ENETC_PSI_SIPCAPR1_NUM_MCH_MASK)

