zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
#define ENETC_PSI_SIPCAPR1_NUM_UCH_MASK          (0xC00U)
#define ENETC_PSI_SIPCAPR1_NUM_UCH_SHIFT         (10U)
#define ENETC_PSI_SIPCAPR1_NUM_UCH_WIDTH         (2U)
#define ENETC_PSI_SIPCAPR1_NUM_UCH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR1_NUM_UCH_SHIFT)) & ENETC_PSI_SIPCAPR1_NUM_UCH_MASK)

#define ENETC_PSI_SIPCAPR1_NUM_MSIX_MASK         (0x3F000U)
#define ENETC_PSI_SIPCAPR1_NUM_MSIX_SHIFT        (12U)
#define ENETC_PSI_SIPCAPR1_NUM_MSIX_WIDTH        (6U)
#define ENETC_PSI_SIPCAPR1_NUM_MSIX(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR1_NUM_MSIX_SHIFT)) & ENETC_PSI_SIPCAPR1_NUM_MSIX_MASK)

#define ENETC_PSI_SIPCAPR1_NUM_IPV_MASK          (0x80000000U)
#define ENETC_PSI_SIPCAPR1_NUM_IPV_SHIFT         (31U)
#define ENETC_PSI_SIPCAPR1_NUM_IPV_WIDTH         (1U)
#define ENETC_PSI_SIPCAPR1_NUM_IPV(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPCAPR1_NUM_IPV_SHIFT)) & ENETC_PSI_SIPCAPR1_NUM_IPV_MASK)
/*! @} */

/*! @name SITSR - Station interface timer status register */
/*! @{ */

#define ENETC_PSI_SITSR_SYNC_MASK                (0x1U)
#define ENETC_PSI_SITSR_SYNC_SHIFT               (0U)
#define ENETC_PSI_SITSR_SYNC_WIDTH               (1U)
#define ENETC_PSI_SITSR_SYNC(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITSR_SYNC_SHIFT)) & ENETC_PSI_SITSR_SYNC_MASK)

#define ENETC_PSI_SITSR_PARAM_VAL_MASK           (0xFFFFFFFEU)
#define ENETC_PSI_SITSR_PARAM_VAL_SHIFT          (1U)
#define ENETC_PSI_SITSR_PARAM_VAL_WIDTH          (31U)
#define ENETC_PSI_SITSR_PARAM_VAL(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITSR_PARAM_VAL_SHIFT)) & ENETC_PSI_SITSR_PARAM_VAL_MASK)
/*! @} */

/*! @name SIRBGCR - Station interface receive BDR group control register */
/*! @{ */

#define ENETC_PSI_SIRBGCR_NUM_GROUPS_MASK        (0x3U)
#define ENETC_PSI_SIRBGCR_NUM_GROUPS_SHIFT       (0U)
#define ENETC_PSI_SIRBGCR_NUM_GROUPS_WIDTH       (2U)
#define ENETC_PSI_SIRBGCR_NUM_GROUPS(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRBGCR_NUM_GROUPS_SHIFT)) & ENETC_PSI_SIRBGCR_NUM_GROUPS_MASK)

#define ENETC_PSI_SIRBGCR_RINGS_PER_GROUP_MASK   (0x70000U)
#define ENETC_PSI_SIRBGCR_RINGS_PER_GROUP_SHIFT  (16U)
#define ENETC_PSI_SIRBGCR_RINGS_PER_GROUP_WIDTH  (3U)
#define ENETC_PSI_SIRBGCR_RINGS_PER_GROUP(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRBGCR_RINGS_PER_GROUP_SHIFT)) & ENETC_PSI_SIRBGCR_RINGS_PER_GROUP_MASK)
/*! @} */

/*! @name SIBCAR - Station interface buffer cache attribute register */
/*! @{ */

#define ENETC_PSI_SIBCAR_BD_WRCACHE_MASK         (0xFU)
#define ENETC_PSI_SIBCAR_BD_WRCACHE_SHIFT        (0U)
#define ENETC_PSI_SIBCAR_BD_WRCACHE_WIDTH        (4U)
#define ENETC_PSI_SIBCAR_BD_WRCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_BD_WRCACHE_SHIFT)) & ENETC_PSI_SIBCAR_BD_WRCACHE_MASK)

#define ENETC_PSI_SIBCAR_BD_WRDOMAIN_MASK        (0x30U)
#define ENETC_PSI_SIBCAR_BD_WRDOMAIN_SHIFT       (4U)
#define ENETC_PSI_SIBCAR_BD_WRDOMAIN_WIDTH       (2U)
#define ENETC_PSI_SIBCAR_BD_WRDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_BD_WRDOMAIN_SHIFT)) & ENETC_PSI_SIBCAR_BD_WRDOMAIN_MASK)

#define ENETC_PSI_SIBCAR_BD_WRSNP_MASK           (0xC0U)
#define ENETC_PSI_SIBCAR_BD_WRSNP_SHIFT          (6U)
#define ENETC_PSI_SIBCAR_BD_WRSNP_WIDTH          (2U)
#define ENETC_PSI_SIBCAR_BD_WRSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_BD_WRSNP_SHIFT)) & ENETC_PSI_SIBCAR_BD_WRSNP_MASK)

#define ENETC_PSI_SIBCAR_WRCACHE_MASK            (0xF00U)
#define ENETC_PSI_SIBCAR_WRCACHE_SHIFT           (8U)
#define ENETC_PSI_SIBCAR_WRCACHE_WIDTH           (4U)
#define ENETC_PSI_SIBCAR_WRCACHE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_WRCACHE_SHIFT)) & ENETC_PSI_SIBCAR_WRCACHE_MASK)

#define ENETC_PSI_SIBCAR_WRDOMAIN_MASK           (0x3000U)
#define ENETC_PSI_SIBCAR_WRDOMAIN_SHIFT          (12U)
#define ENETC_PSI_SIBCAR_WRDOMAIN_WIDTH          (2U)
#define ENETC_PSI_SIBCAR_WRDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_WRDOMAIN_SHIFT)) & ENETC_PSI_SIBCAR_WRDOMAIN_MASK)

#define ENETC_PSI_SIBCAR_WRSNP_MASK              (0xC000U)
#define ENETC_PSI_SIBCAR_WRSNP_SHIFT             (14U)
#define ENETC_PSI_SIBCAR_WRSNP_WIDTH             (2U)
#define ENETC_PSI_SIBCAR_WRSNP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_WRSNP_SHIFT)) & ENETC_PSI_SIBCAR_WRSNP_MASK)

#define ENETC_PSI_SIBCAR_BD_RDCACHE_MASK         (0xF0000U)
#define ENETC_PSI_SIBCAR_BD_RDCACHE_SHIFT        (16U)
#define ENETC_PSI_SIBCAR_BD_RDCACHE_WIDTH        (4U)
#define ENETC_PSI_SIBCAR_BD_RDCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_BD_RDCACHE_SHIFT)) & ENETC_PSI_SIBCAR_BD_RDCACHE_MASK)

#define ENETC_PSI_SIBCAR_BD_RDDOMAIN_MASK        (0x300000U)
#define ENETC_PSI_SIBCAR_BD_RDDOMAIN_SHIFT       (20U)
#define ENETC_PSI_SIBCAR_BD_RDDOMAIN_WIDTH       (2U)
#define ENETC_PSI_SIBCAR_BD_RDDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_BD_RDDOMAIN_SHIFT)) & ENETC_PSI_SIBCAR_BD_RDDOMAIN_MASK)

#define ENETC_PSI_SIBCAR_BD_RDSNP_MASK           (0xC00000U)
#define ENETC_PSI_SIBCAR_BD_RDSNP_SHIFT          (22U)
#define ENETC_PSI_SIBCAR_BD_RDSNP_WIDTH          (2U)
#define ENETC_PSI_SIBCAR_BD_RDSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_BD_RDSNP_SHIFT)) & ENETC_PSI_SIBCAR_BD_RDSNP_MASK)

#define ENETC_PSI_SIBCAR_RDCACHE_MASK            (0xF000000U)
#define ENETC_PSI_SIBCAR_RDCACHE_SHIFT           (24U)
#define ENETC_PSI_SIBCAR_RDCACHE_WIDTH           (4U)
#define ENETC_PSI_SIBCAR_RDCACHE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_RDCACHE_SHIFT)) & ENETC_PSI_SIBCAR_RDCACHE_MASK)

#define ENETC_PSI_SIBCAR_RDDOMAIN_MASK           (0x30000000U)
#define ENETC_PSI_SIBCAR_RDDOMAIN_SHIFT          (28U)
#define ENETC_PSI_SIBCAR_RDDOMAIN_WIDTH          (2U)
#define ENETC_PSI_SIBCAR_RDDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_RDDOMAIN_SHIFT)) & ENETC_PSI_SIBCAR_RDDOMAIN_MASK)

