zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
#define ENETC_PSI_SIBCAR_RDSNP_MASK              (0xC0000000U)
#define ENETC_PSI_SIBCAR_RDSNP_SHIFT             (30U)
#define ENETC_PSI_SIBCAR_RDSNP_WIDTH             (2U)
#define ENETC_PSI_SIBCAR_RDSNP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIBCAR_RDSNP_SHIFT)) & ENETC_PSI_SIBCAR_RDSNP_MASK)
/*! @} */

/*! @name SIMCAR - Station interface message cache attribute register */
/*! @{ */

#define ENETC_PSI_SIMCAR_MSG_WRCACHE_MASK        (0xFU)
#define ENETC_PSI_SIMCAR_MSG_WRCACHE_SHIFT       (0U)
#define ENETC_PSI_SIMCAR_MSG_WRCACHE_WIDTH       (4U)
#define ENETC_PSI_SIMCAR_MSG_WRCACHE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIMCAR_MSG_WRCACHE_SHIFT)) & ENETC_PSI_SIMCAR_MSG_WRCACHE_MASK)

#define ENETC_PSI_SIMCAR_MSG_WRDOMAIN_MASK       (0x30U)
#define ENETC_PSI_SIMCAR_MSG_WRDOMAIN_SHIFT      (4U)
#define ENETC_PSI_SIMCAR_MSG_WRDOMAIN_WIDTH      (2U)
#define ENETC_PSI_SIMCAR_MSG_WRDOMAIN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIMCAR_MSG_WRDOMAIN_SHIFT)) & ENETC_PSI_SIMCAR_MSG_WRDOMAIN_MASK)

#define ENETC_PSI_SIMCAR_MSG_WRSNP_MASK          (0xC0U)
#define ENETC_PSI_SIMCAR_MSG_WRSNP_SHIFT         (6U)
#define ENETC_PSI_SIMCAR_MSG_WRSNP_WIDTH         (2U)
#define ENETC_PSI_SIMCAR_MSG_WRSNP(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIMCAR_MSG_WRSNP_SHIFT)) & ENETC_PSI_SIMCAR_MSG_WRSNP_MASK)

#define ENETC_PSI_SIMCAR_MSG_RDCACHE_MASK        (0xF0000U)
#define ENETC_PSI_SIMCAR_MSG_RDCACHE_SHIFT       (16U)
#define ENETC_PSI_SIMCAR_MSG_RDCACHE_WIDTH       (4U)
#define ENETC_PSI_SIMCAR_MSG_RDCACHE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIMCAR_MSG_RDCACHE_SHIFT)) & ENETC_PSI_SIMCAR_MSG_RDCACHE_MASK)

#define ENETC_PSI_SIMCAR_MSG_RDDOMAIN_MASK       (0x300000U)
#define ENETC_PSI_SIMCAR_MSG_RDDOMAIN_SHIFT      (20U)
#define ENETC_PSI_SIMCAR_MSG_RDDOMAIN_WIDTH      (2U)
#define ENETC_PSI_SIMCAR_MSG_RDDOMAIN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIMCAR_MSG_RDDOMAIN_SHIFT)) & ENETC_PSI_SIMCAR_MSG_RDDOMAIN_MASK)

#define ENETC_PSI_SIMCAR_MSG_RDSNP_MASK          (0xC00000U)
#define ENETC_PSI_SIMCAR_MSG_RDSNP_SHIFT         (22U)
#define ENETC_PSI_SIMCAR_MSG_RDSNP_WIDTH         (2U)
#define ENETC_PSI_SIMCAR_MSG_RDSNP(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIMCAR_MSG_RDSNP_SHIFT)) & ENETC_PSI_SIMCAR_MSG_RDSNP_MASK)
/*! @} */

/*! @name SICCAR - Station interface command cache attribute register */
/*! @{ */

#define ENETC_PSI_SICCAR_CBD_WRCACHE_MASK        (0xFU)
#define ENETC_PSI_SICCAR_CBD_WRCACHE_SHIFT       (0U)
#define ENETC_PSI_SICCAR_CBD_WRCACHE_WIDTH       (4U)
#define ENETC_PSI_SICCAR_CBD_WRCACHE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CBD_WRCACHE_SHIFT)) & ENETC_PSI_SICCAR_CBD_WRCACHE_MASK)

#define ENETC_PSI_SICCAR_CBD_WRDOMAIN_MASK       (0x30U)
#define ENETC_PSI_SICCAR_CBD_WRDOMAIN_SHIFT      (4U)
#define ENETC_PSI_SICCAR_CBD_WRDOMAIN_WIDTH      (2U)
#define ENETC_PSI_SICCAR_CBD_WRDOMAIN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CBD_WRDOMAIN_SHIFT)) & ENETC_PSI_SICCAR_CBD_WRDOMAIN_MASK)

#define ENETC_PSI_SICCAR_CBD_WRSNP_MASK          (0xC0U)
#define ENETC_PSI_SICCAR_CBD_WRSNP_SHIFT         (6U)
#define ENETC_PSI_SICCAR_CBD_WRSNP_WIDTH         (2U)
#define ENETC_PSI_SICCAR_CBD_WRSNP(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CBD_WRSNP_SHIFT)) & ENETC_PSI_SICCAR_CBD_WRSNP_MASK)

#define ENETC_PSI_SICCAR_CWRCACHE_MASK           (0xF00U)
#define ENETC_PSI_SICCAR_CWRCACHE_SHIFT          (8U)
#define ENETC_PSI_SICCAR_CWRCACHE_WIDTH          (4U)
#define ENETC_PSI_SICCAR_CWRCACHE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CWRCACHE_SHIFT)) & ENETC_PSI_SICCAR_CWRCACHE_MASK)

#define ENETC_PSI_SICCAR_CWRDOMAIN_MASK          (0x3000U)
#define ENETC_PSI_SICCAR_CWRDOMAIN_SHIFT         (12U)
#define ENETC_PSI_SICCAR_CWRDOMAIN_WIDTH         (2U)
#define ENETC_PSI_SICCAR_CWRDOMAIN(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CWRDOMAIN_SHIFT)) & ENETC_PSI_SICCAR_CWRDOMAIN_MASK)

#define ENETC_PSI_SICCAR_CWRSNP_MASK             (0xC000U)
#define ENETC_PSI_SICCAR_CWRSNP_SHIFT            (14U)
#define ENETC_PSI_SICCAR_CWRSNP_WIDTH            (2U)
#define ENETC_PSI_SICCAR_CWRSNP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CWRSNP_SHIFT)) & ENETC_PSI_SICCAR_CWRSNP_MASK)

#define ENETC_PSI_SICCAR_CBD_RDCACHE_MASK        (0xF0000U)
#define ENETC_PSI_SICCAR_CBD_RDCACHE_SHIFT       (16U)
#define ENETC_PSI_SICCAR_CBD_RDCACHE_WIDTH       (4U)
#define ENETC_PSI_SICCAR_CBD_RDCACHE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CBD_RDCACHE_SHIFT)) & ENETC_PSI_SICCAR_CBD_RDCACHE_MASK)

#define ENETC_PSI_SICCAR_CBD_RDDOMAIN_MASK       (0x300000U)
#define ENETC_PSI_SICCAR_CBD_RDDOMAIN_SHIFT      (20U)
#define ENETC_PSI_SICCAR_CBD_RDDOMAIN_WIDTH      (2U)
#define ENETC_PSI_SICCAR_CBD_RDDOMAIN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CBD_RDDOMAIN_SHIFT)) & ENETC_PSI_SICCAR_CBD_RDDOMAIN_MASK)

#define ENETC_PSI_SICCAR_CBD_RDSNP_MASK          (0xC00000U)
#define ENETC_PSI_SICCAR_CBD_RDSNP_SHIFT         (22U)
#define ENETC_PSI_SICCAR_CBD_RDSNP_WIDTH         (2U)
#define ENETC_PSI_SICCAR_CBD_RDSNP(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CBD_RDSNP_SHIFT)) & ENETC_PSI_SICCAR_CBD_RDSNP_MASK)

#define ENETC_PSI_SICCAR_CRDCACHE_MASK           (0xF000000U)
#define ENETC_PSI_SICCAR_CRDCACHE_SHIFT          (24U)
#define ENETC_PSI_SICCAR_CRDCACHE_WIDTH          (4U)
#define ENETC_PSI_SICCAR_CRDCACHE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CRDCACHE_SHIFT)) & ENETC_PSI_SICCAR_CRDCACHE_MASK)

#define ENETC_PSI_SICCAR_CRDDOMAIN_MASK          (0x30000000U)
#define ENETC_PSI_SICCAR_CRDDOMAIN_SHIFT         (28U)
#define ENETC_PSI_SICCAR_CRDDOMAIN_WIDTH         (2U)
#define ENETC_PSI_SICCAR_CRDDOMAIN(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CRDDOMAIN_SHIFT)) & ENETC_PSI_SICCAR_CRDDOMAIN_MASK)

#define ENETC_PSI_SICCAR_CRDSNP_MASK             (0xC0000000U)
#define ENETC_PSI_SICCAR_CRDSNP_SHIFT            (30U)
#define ENETC_PSI_SICCAR_CRDSNP_WIDTH            (2U)
#define ENETC_PSI_SICCAR_CRDSNP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICCAR_CRDSNP_SHIFT)) & ENETC_PSI_SICCAR_CRDSNP_MASK)
/*! @} */

