zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
/*! @name SIPMAR0 - Station interface primary MAC address register 0 */
/*! @{ */

#define ENETC_PSI_SIPMAR0_PRIM_MAC_ADDR_MASK     (0xFFFFFFFFU)
#define ENETC_PSI_SIPMAR0_PRIM_MAC_ADDR_SHIFT    (0U)
#define ENETC_PSI_SIPMAR0_PRIM_MAC_ADDR_WIDTH    (32U)
#define ENETC_PSI_SIPMAR0_PRIM_MAC_ADDR(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPMAR0_PRIM_MAC_ADDR_SHIFT)) & ENETC_PSI_SIPMAR0_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name SIPMAR1 - Station interface primary MAC address register 1 */
/*! @{ */

#define ENETC_PSI_SIPMAR1_PRIM_MAC_ADDR_MASK     (0xFFFFU)
#define ENETC_PSI_SIPMAR1_PRIM_MAC_ADDR_SHIFT    (0U)
#define ENETC_PSI_SIPMAR1_PRIM_MAC_ADDR_WIDTH    (16U)
#define ENETC_PSI_SIPMAR1_PRIM_MAC_ADDR(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIPMAR1_PRIM_MAC_ADDR_SHIFT)) & ENETC_PSI_SIPMAR1_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name SICVLANR1 - Station interface custom VLAN register 1 */
/*! @{ */

#define ENETC_PSI_SICVLANR1_ETYPE_MASK           (0xFFFFU)
#define ENETC_PSI_SICVLANR1_ETYPE_SHIFT          (0U)
#define ENETC_PSI_SICVLANR1_ETYPE_WIDTH          (16U)
#define ENETC_PSI_SICVLANR1_ETYPE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICVLANR1_ETYPE_SHIFT)) & ENETC_PSI_SICVLANR1_ETYPE_MASK)

#define ENETC_PSI_SICVLANR1_V_MASK               (0x80000000U)
#define ENETC_PSI_SICVLANR1_V_SHIFT              (31U)
#define ENETC_PSI_SICVLANR1_V_WIDTH              (1U)
#define ENETC_PSI_SICVLANR1_V(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICVLANR1_V_SHIFT)) & ENETC_PSI_SICVLANR1_V_MASK)
/*! @} */

/*! @name SICVLANR2 - Station interface custom VLAN register 2 */
/*! @{ */

#define ENETC_PSI_SICVLANR2_ETYPE_MASK           (0xFFFFU)
#define ENETC_PSI_SICVLANR2_ETYPE_SHIFT          (0U)
#define ENETC_PSI_SICVLANR2_ETYPE_WIDTH          (16U)
#define ENETC_PSI_SICVLANR2_ETYPE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICVLANR2_ETYPE_SHIFT)) & ENETC_PSI_SICVLANR2_ETYPE_MASK)

#define ENETC_PSI_SICVLANR2_V_MASK               (0x80000000U)
#define ENETC_PSI_SICVLANR2_V_SHIFT              (31U)
#define ENETC_PSI_SICVLANR2_V_WIDTH              (1U)
#define ENETC_PSI_SICVLANR2_V(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICVLANR2_V_SHIFT)) & ENETC_PSI_SICVLANR2_V_MASK)
/*! @} */

/*! @name SIVLANIPVMR0 - Station interface VLAN to IPV mapping register 0 */
/*! @{ */

#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_0_MASK    (0xFU)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_0_SHIFT   (0U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_0_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_0(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR0_PCP_DEI_0_SHIFT)) & ENETC_PSI_SIVLANIPVMR0_PCP_DEI_0_MASK)

#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_1_MASK    (0xF0U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_1_SHIFT   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_1_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_1(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR0_PCP_DEI_1_SHIFT)) & ENETC_PSI_SIVLANIPVMR0_PCP_DEI_1_MASK)

#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_2_MASK    (0xF00U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_2_SHIFT   (8U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_2_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_2(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR0_PCP_DEI_2_SHIFT)) & ENETC_PSI_SIVLANIPVMR0_PCP_DEI_2_MASK)

#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_3_MASK    (0xF000U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_3_SHIFT   (12U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_3_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_3(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR0_PCP_DEI_3_SHIFT)) & ENETC_PSI_SIVLANIPVMR0_PCP_DEI_3_MASK)

#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_4_MASK    (0xF0000U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_4_SHIFT   (16U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_4_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_4(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR0_PCP_DEI_4_SHIFT)) & ENETC_PSI_SIVLANIPVMR0_PCP_DEI_4_MASK)

#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_5_MASK    (0xF00000U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_5_SHIFT   (20U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_5_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_5(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR0_PCP_DEI_5_SHIFT)) & ENETC_PSI_SIVLANIPVMR0_PCP_DEI_5_MASK)

#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_6_MASK    (0xF000000U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_6_SHIFT   (24U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_6_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_6(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR0_PCP_DEI_6_SHIFT)) & ENETC_PSI_SIVLANIPVMR0_PCP_DEI_6_MASK)

#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_7_MASK    (0xF0000000U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_7_SHIFT   (28U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_7_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR0_PCP_DEI_7(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR0_PCP_DEI_7_SHIFT)) & ENETC_PSI_SIVLANIPVMR0_PCP_DEI_7_MASK)
/*! @} */

/*! @name SIVLANIPVMR1 - Station interface VLAN to IPV mapping register 1 */
/*! @{ */

#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_8_MASK    (0xFU)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_8_SHIFT   (0U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_8_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_8(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR1_PCP_DEI_8_SHIFT)) & ENETC_PSI_SIVLANIPVMR1_PCP_DEI_8_MASK)

#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_9_MASK    (0xF0U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_9_SHIFT   (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_9_WIDTH   (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_9(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR1_PCP_DEI_9_SHIFT)) & ENETC_PSI_SIVLANIPVMR1_PCP_DEI_9_MASK)

#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_10_MASK   (0xF00U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_10_SHIFT  (8U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_10_WIDTH  (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_10(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR1_PCP_DEI_10_SHIFT)) & ENETC_PSI_SIVLANIPVMR1_PCP_DEI_10_MASK)

#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_11_MASK   (0xF000U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_11_SHIFT  (12U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_11_WIDTH  (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_11(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR1_PCP_DEI_11_SHIFT)) & ENETC_PSI_SIVLANIPVMR1_PCP_DEI_11_MASK)

