zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_12_MASK   (0xF0000U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_12_SHIFT  (16U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_12_WIDTH  (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_12(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR1_PCP_DEI_12_SHIFT)) & ENETC_PSI_SIVLANIPVMR1_PCP_DEI_12_MASK)

#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_13_MASK   (0xF00000U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_13_SHIFT  (20U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_13_WIDTH  (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_13(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR1_PCP_DEI_13_SHIFT)) & ENETC_PSI_SIVLANIPVMR1_PCP_DEI_13_MASK)

#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_14_MASK   (0xF000000U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_14_SHIFT  (24U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_14_WIDTH  (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_14(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR1_PCP_DEI_14_SHIFT)) & ENETC_PSI_SIVLANIPVMR1_PCP_DEI_14_MASK)

#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_15_MASK   (0xF0000000U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_15_SHIFT  (28U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_15_WIDTH  (4U)
#define ENETC_PSI_SIVLANIPVMR1_PCP_DEI_15(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIVLANIPVMR1_PCP_DEI_15_SHIFT)) & ENETC_PSI_SIVLANIPVMR1_PCP_DEI_15_MASK)
/*! @} */

/*! @name SIIPVBDRMR0 - Station interface IPV to ring mapping register */
/*! @{ */

#define ENETC_PSI_SIIPVBDRMR0_IPV0BDR_MASK       (0x7U)
#define ENETC_PSI_SIIPVBDRMR0_IPV0BDR_SHIFT      (0U)
#define ENETC_PSI_SIIPVBDRMR0_IPV0BDR_WIDTH      (3U)
#define ENETC_PSI_SIIPVBDRMR0_IPV0BDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIIPVBDRMR0_IPV0BDR_SHIFT)) & ENETC_PSI_SIIPVBDRMR0_IPV0BDR_MASK)

#define ENETC_PSI_SIIPVBDRMR0_IPV1BDR_MASK       (0x70U)
#define ENETC_PSI_SIIPVBDRMR0_IPV1BDR_SHIFT      (4U)
#define ENETC_PSI_SIIPVBDRMR0_IPV1BDR_WIDTH      (3U)
#define ENETC_PSI_SIIPVBDRMR0_IPV1BDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIIPVBDRMR0_IPV1BDR_SHIFT)) & ENETC_PSI_SIIPVBDRMR0_IPV1BDR_MASK)

#define ENETC_PSI_SIIPVBDRMR0_IPV2BDR_MASK       (0x700U)
#define ENETC_PSI_SIIPVBDRMR0_IPV2BDR_SHIFT      (8U)
#define ENETC_PSI_SIIPVBDRMR0_IPV2BDR_WIDTH      (3U)
#define ENETC_PSI_SIIPVBDRMR0_IPV2BDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIIPVBDRMR0_IPV2BDR_SHIFT)) & ENETC_PSI_SIIPVBDRMR0_IPV2BDR_MASK)

#define ENETC_PSI_SIIPVBDRMR0_IPV3BDR_MASK       (0x7000U)
#define ENETC_PSI_SIIPVBDRMR0_IPV3BDR_SHIFT      (12U)
#define ENETC_PSI_SIIPVBDRMR0_IPV3BDR_WIDTH      (3U)
#define ENETC_PSI_SIIPVBDRMR0_IPV3BDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIIPVBDRMR0_IPV3BDR_SHIFT)) & ENETC_PSI_SIIPVBDRMR0_IPV3BDR_MASK)

#define ENETC_PSI_SIIPVBDRMR0_IPV4BDR_MASK       (0x70000U)
#define ENETC_PSI_SIIPVBDRMR0_IPV4BDR_SHIFT      (16U)
#define ENETC_PSI_SIIPVBDRMR0_IPV4BDR_WIDTH      (3U)
#define ENETC_PSI_SIIPVBDRMR0_IPV4BDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIIPVBDRMR0_IPV4BDR_SHIFT)) & ENETC_PSI_SIIPVBDRMR0_IPV4BDR_MASK)

#define ENETC_PSI_SIIPVBDRMR0_IPV5BDR_MASK       (0x700000U)
#define ENETC_PSI_SIIPVBDRMR0_IPV5BDR_SHIFT      (20U)
#define ENETC_PSI_SIIPVBDRMR0_IPV5BDR_WIDTH      (3U)
#define ENETC_PSI_SIIPVBDRMR0_IPV5BDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIIPVBDRMR0_IPV5BDR_SHIFT)) & ENETC_PSI_SIIPVBDRMR0_IPV5BDR_MASK)

#define ENETC_PSI_SIIPVBDRMR0_IPV6BDR_MASK       (0x7000000U)
#define ENETC_PSI_SIIPVBDRMR0_IPV6BDR_SHIFT      (24U)
#define ENETC_PSI_SIIPVBDRMR0_IPV6BDR_WIDTH      (3U)
#define ENETC_PSI_SIIPVBDRMR0_IPV6BDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIIPVBDRMR0_IPV6BDR_SHIFT)) & ENETC_PSI_SIIPVBDRMR0_IPV6BDR_MASK)

#define ENETC_PSI_SIIPVBDRMR0_IPV7BDR_MASK       (0x70000000U)
#define ENETC_PSI_SIIPVBDRMR0_IPV7BDR_SHIFT      (28U)
#define ENETC_PSI_SIIPVBDRMR0_IPV7BDR_WIDTH      (3U)
#define ENETC_PSI_SIIPVBDRMR0_IPV7BDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIIPVBDRMR0_IPV7BDR_SHIFT)) & ENETC_PSI_SIIPVBDRMR0_IPV7BDR_MASK)
/*! @} */

/*! @name PSIMSGRR - Physical station interface message receive register */
/*! @{ */

#define ENETC_PSI_PSIMSGRR_MR1_MASK              (0x2U)
#define ENETC_PSI_PSIMSGRR_MR1_SHIFT             (1U)
#define ENETC_PSI_PSIMSGRR_MR1_WIDTH             (1U)
#define ENETC_PSI_PSIMSGRR_MR1(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGRR_MR1_SHIFT)) & ENETC_PSI_PSIMSGRR_MR1_MASK)

#define ENETC_PSI_PSIMSGRR_MR2_MASK              (0x4U)
#define ENETC_PSI_PSIMSGRR_MR2_SHIFT             (2U)
#define ENETC_PSI_PSIMSGRR_MR2_WIDTH             (1U)
#define ENETC_PSI_PSIMSGRR_MR2(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGRR_MR2_SHIFT)) & ENETC_PSI_PSIMSGRR_MR2_MASK)

#define ENETC_PSI_PSIMSGRR_MR3_MASK              (0x8U)
#define ENETC_PSI_PSIMSGRR_MR3_SHIFT             (3U)
#define ENETC_PSI_PSIMSGRR_MR3_WIDTH             (1U)
#define ENETC_PSI_PSIMSGRR_MR3(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGRR_MR3_SHIFT)) & ENETC_PSI_PSIMSGRR_MR3_MASK)

#define ENETC_PSI_PSIMSGRR_MR4_MASK              (0x10U)
#define ENETC_PSI_PSIMSGRR_MR4_SHIFT             (4U)
#define ENETC_PSI_PSIMSGRR_MR4_WIDTH             (1U)
#define ENETC_PSI_PSIMSGRR_MR4(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGRR_MR4_SHIFT)) & ENETC_PSI_PSIMSGRR_MR4_MASK)

#define ENETC_PSI_PSIMSGRR_MR5_MASK              (0x20U)
#define ENETC_PSI_PSIMSGRR_MR5_SHIFT             (5U)
#define ENETC_PSI_PSIMSGRR_MR5_WIDTH             (1U)
#define ENETC_PSI_PSIMSGRR_MR5(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGRR_MR5_SHIFT)) & ENETC_PSI_PSIMSGRR_MR5_MASK)

#define ENETC_PSI_PSIMSGRR_MC_MASK               (0xFFFF0000U)
#define ENETC_PSI_PSIMSGRR_MC_SHIFT              (16U)
#define ENETC_PSI_PSIMSGRR_MC_WIDTH              (16U)
#define ENETC_PSI_PSIMSGRR_MC(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGRR_MC_SHIFT)) & ENETC_PSI_PSIMSGRR_MC_MASK)
/*! @} */

/*! @name PSIMSGSR - Physical station interface message send register */
/*! @{ */

#define ENETC_PSI_PSIMSGSR_MS1_MASK              (0x2U)
#define ENETC_PSI_PSIMSGSR_MS1_SHIFT             (1U)
#define ENETC_PSI_PSIMSGSR_MS1_WIDTH             (1U)
#define ENETC_PSI_PSIMSGSR_MS1(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGSR_MS1_SHIFT)) & ENETC_PSI_PSIMSGSR_MS1_MASK)

#define ENETC_PSI_PSIMSGSR_MS2_MASK              (0x4U)
#define ENETC_PSI_PSIMSGSR_MS2_SHIFT             (2U)
#define ENETC_PSI_PSIMSGSR_MS2_WIDTH             (1U)
#define ENETC_PSI_PSIMSGSR_MS2(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGSR_MS2_SHIFT)) & ENETC_PSI_PSIMSGSR_MS2_MASK)

