zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
#define ENETC_PSI_PSIMSGSR_MS3_MASK              (0x8U)
#define ENETC_PSI_PSIMSGSR_MS3_SHIFT             (3U)
#define ENETC_PSI_PSIMSGSR_MS3_WIDTH             (1U)
#define ENETC_PSI_PSIMSGSR_MS3(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGSR_MS3_SHIFT)) & ENETC_PSI_PSIMSGSR_MS3_MASK)

#define ENETC_PSI_PSIMSGSR_MS4_MASK              (0x10U)
#define ENETC_PSI_PSIMSGSR_MS4_SHIFT             (4U)
#define ENETC_PSI_PSIMSGSR_MS4_WIDTH             (1U)
#define ENETC_PSI_PSIMSGSR_MS4(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGSR_MS4_SHIFT)) & ENETC_PSI_PSIMSGSR_MS4_MASK)

#define ENETC_PSI_PSIMSGSR_MS5_MASK              (0x20U)
#define ENETC_PSI_PSIMSGSR_MS5_SHIFT             (5U)
#define ENETC_PSI_PSIMSGSR_MS5_WIDTH             (1U)
#define ENETC_PSI_PSIMSGSR_MS5(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGSR_MS5_SHIFT)) & ENETC_PSI_PSIMSGSR_MS5_MASK)

#define ENETC_PSI_PSIMSGSR_MC_MASK               (0xFFFF0000U)
#define ENETC_PSI_PSIMSGSR_MC_SHIFT              (16U)
#define ENETC_PSI_PSIMSGSR_MC_WIDTH              (16U)
#define ENETC_PSI_PSIMSGSR_MC(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIMSGSR_MC_SHIFT)) & ENETC_PSI_PSIMSGSR_MC_MASK)
/*! @} */

/*! @name PSIVMSGRCVAR0 - PSI VSI 1 message receive address register 0..PSI VSI 5 message receive address register 0 */
/*! @{ */

#define ENETC_PSI_PSIVMSGRCVAR0_MSIZE_MASK       (0x1FU)
#define ENETC_PSI_PSIVMSGRCVAR0_MSIZE_SHIFT      (0U)
#define ENETC_PSI_PSIVMSGRCVAR0_MSIZE_WIDTH      (5U)
#define ENETC_PSI_PSIVMSGRCVAR0_MSIZE(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIVMSGRCVAR0_MSIZE_SHIFT)) & ENETC_PSI_PSIVMSGRCVAR0_MSIZE_MASK)

#define ENETC_PSI_PSIVMSGRCVAR0_ADDRL_MASK       (0xFFFFFFC0U)
#define ENETC_PSI_PSIVMSGRCVAR0_ADDRL_SHIFT      (6U)
#define ENETC_PSI_PSIVMSGRCVAR0_ADDRL_WIDTH      (26U)
#define ENETC_PSI_PSIVMSGRCVAR0_ADDRL(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIVMSGRCVAR0_ADDRL_SHIFT)) & ENETC_PSI_PSIVMSGRCVAR0_ADDRL_MASK)
/*! @} */

/*! @name PSIVMSGRCVAR1 - PSI VSI 1 message receive address register 1..PSI VSI 5 message receive address register 1 */
/*! @{ */

#define ENETC_PSI_PSIVMSGRCVAR1_ADDRH_MASK       (0xFFFFFFFFU)
#define ENETC_PSI_PSIVMSGRCVAR1_ADDRH_SHIFT      (0U)
#define ENETC_PSI_PSIVMSGRCVAR1_ADDRH_WIDTH      (32U)
#define ENETC_PSI_PSIVMSGRCVAR1_ADDRH(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIVMSGRCVAR1_ADDRH_SHIFT)) & ENETC_PSI_PSIVMSGRCVAR1_ADDRH_MASK)
/*! @} */

/*! @name SIROCT0 - Station interface receive octets counter (ifInOctets) 0 */
/*! @{ */

#define ENETC_PSI_SIROCT0_ROCT_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_PSI_SIROCT0_ROCT_LOW_SHIFT         (0U)
#define ENETC_PSI_SIROCT0_ROCT_LOW_WIDTH         (32U)
#define ENETC_PSI_SIROCT0_ROCT_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIROCT0_ROCT_LOW_SHIFT)) & ENETC_PSI_SIROCT0_ROCT_LOW_MASK)
/*! @} */

/*! @name SIROCT1 - Station interface receive octets counter (ifInOctets) 1 */
/*! @{ */

#define ENETC_PSI_SIROCT1_ROCT_HIGH_MASK         (0xFFFFFFFFU)
#define ENETC_PSI_SIROCT1_ROCT_HIGH_SHIFT        (0U)
#define ENETC_PSI_SIROCT1_ROCT_HIGH_WIDTH        (32U)
#define ENETC_PSI_SIROCT1_ROCT_HIGH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIROCT1_ROCT_HIGH_SHIFT)) & ENETC_PSI_SIROCT1_ROCT_HIGH_MASK)
/*! @} */

/*! @name SIRFRM0 - Station interface receive frame counter (aFrameReceivedOK) 0 */
/*! @{ */

#define ENETC_PSI_SIRFRM0_RFRM_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_PSI_SIRFRM0_RFRM_LOW_SHIFT         (0U)
#define ENETC_PSI_SIRFRM0_RFRM_LOW_WIDTH         (32U)
#define ENETC_PSI_SIRFRM0_RFRM_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRFRM0_RFRM_LOW_SHIFT)) & ENETC_PSI_SIRFRM0_RFRM_LOW_MASK)
/*! @} */

/*! @name SIRFRM1 - Station interface receive frame counter (aFrameReceivedOK) 1 */
/*! @{ */

#define ENETC_PSI_SIRFRM1_RFRM_HIGH_MASK         (0xFFFFFFFFU)
#define ENETC_PSI_SIRFRM1_RFRM_HIGH_SHIFT        (0U)
#define ENETC_PSI_SIRFRM1_RFRM_HIGH_WIDTH        (32U)
#define ENETC_PSI_SIRFRM1_RFRM_HIGH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRFRM1_RFRM_HIGH_SHIFT)) & ENETC_PSI_SIRFRM1_RFRM_HIGH_MASK)
/*! @} */

/*! @name SIRUCA0 - Station interface receive unicast frame counter (ifInUcastPkts) 0 */
/*! @{ */

#define ENETC_PSI_SIRUCA0_RUCA_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_PSI_SIRUCA0_RUCA_LOW_SHIFT         (0U)
#define ENETC_PSI_SIRUCA0_RUCA_LOW_WIDTH         (32U)
#define ENETC_PSI_SIRUCA0_RUCA_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRUCA0_RUCA_LOW_SHIFT)) & ENETC_PSI_SIRUCA0_RUCA_LOW_MASK)
/*! @} */

/*! @name SIRUCA1 - Station interface receive unicast frame counter (ifInUcastPkts) 1 */
/*! @{ */

#define ENETC_PSI_SIRUCA1_RUCA_HIGH_MASK         (0xFFFFFFFFU)
#define ENETC_PSI_SIRUCA1_RUCA_HIGH_SHIFT        (0U)
#define ENETC_PSI_SIRUCA1_RUCA_HIGH_WIDTH        (32U)
#define ENETC_PSI_SIRUCA1_RUCA_HIGH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRUCA1_RUCA_HIGH_SHIFT)) & ENETC_PSI_SIRUCA1_RUCA_HIGH_MASK)
/*! @} */

/*! @name SIRMCA0 - Station interface receive multicast frame counter (ifInMulticastPkts) 0 */
/*! @{ */

#define ENETC_PSI_SIRMCA0_RMCA_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_PSI_SIRMCA0_RMCA_LOW_SHIFT         (0U)
#define ENETC_PSI_SIRMCA0_RMCA_LOW_WIDTH         (32U)
#define ENETC_PSI_SIRMCA0_RMCA_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRMCA0_RMCA_LOW_SHIFT)) & ENETC_PSI_SIRMCA0_RMCA_LOW_MASK)
/*! @} */

/*! @name SIRMCA1 - Station interface receive multicast frame counter (ifInMulticastPkts) 1 */
/*! @{ */

#define ENETC_PSI_SIRMCA1_RMCA_HIGH_MASK         (0xFFFFFFFFU)
#define ENETC_PSI_SIRMCA1_RMCA_HIGH_SHIFT        (0U)
#define ENETC_PSI_SIRMCA1_RMCA_HIGH_WIDTH        (32U)
#define ENETC_PSI_SIRMCA1_RMCA_HIGH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRMCA1_RMCA_HIGH_SHIFT)) & ENETC_PSI_SIRMCA1_RMCA_HIGH_MASK)
/*! @} */

/*! @name SITOCT0 - Station interface transmit octets counter (ifOutOctets) 0 */
/*! @{ */

#define ENETC_PSI_SITOCT0_TOCT_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_PSI_SITOCT0_TOCT_LOW_SHIFT         (0U)
#define ENETC_PSI_SITOCT0_TOCT_LOW_WIDTH         (32U)
#define ENETC_PSI_SITOCT0_TOCT_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITOCT0_TOCT_LOW_SHIFT)) & ENETC_PSI_SITOCT0_TOCT_LOW_MASK)
/*! @} */

