zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
/*! @name SICBDRLENR - Station interface command BDR length register */
/*! @{ */

#define ENETC_PSI_SICBDRLENR_LENGTH_MASK         (0x7F8U)
#define ENETC_PSI_SICBDRLENR_LENGTH_SHIFT        (3U)
#define ENETC_PSI_SICBDRLENR_LENGTH_WIDTH        (8U)
#define ENETC_PSI_SICBDRLENR_LENGTH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICBDRLENR_LENGTH_SHIFT)) & ENETC_PSI_SICBDRLENR_LENGTH_MASK)
/*! @} */

/*! @name SICBDRIER - Station interface command BDR interrupt enable register */
/*! @{ */

#define ENETC_PSI_SICBDRIER_CBDCIE_MASK          (0x1U)
#define ENETC_PSI_SICBDRIER_CBDCIE_SHIFT         (0U)
#define ENETC_PSI_SICBDRIER_CBDCIE_WIDTH         (1U)
#define ENETC_PSI_SICBDRIER_CBDCIE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICBDRIER_CBDCIE_SHIFT)) & ENETC_PSI_SICBDRIER_CBDCIE_MASK)
/*! @} */

/*! @name SICBDRIDR - Station interface command BDR interrupt detect register */
/*! @{ */

#define ENETC_PSI_SICBDRIDR_CBDC_MASK            (0x1U)
#define ENETC_PSI_SICBDRIDR_CBDC_SHIFT           (0U)
#define ENETC_PSI_SICBDRIDR_CBDC_WIDTH           (1U)
#define ENETC_PSI_SICBDRIDR_CBDC(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICBDRIDR_CBDC_SHIFT)) & ENETC_PSI_SICBDRIDR_CBDC_MASK)
/*! @} */

/*! @name SICAPR0 - Station interface capability register 0 */
/*! @{ */

#define ENETC_PSI_SICAPR0_NUM_TX_BDR_MASK        (0xFFU)
#define ENETC_PSI_SICAPR0_NUM_TX_BDR_SHIFT       (0U)
#define ENETC_PSI_SICAPR0_NUM_TX_BDR_WIDTH       (8U)
#define ENETC_PSI_SICAPR0_NUM_TX_BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICAPR0_NUM_TX_BDR_SHIFT)) & ENETC_PSI_SICAPR0_NUM_TX_BDR_MASK)

#define ENETC_PSI_SICAPR0_NUM_RX_BDR_MASK        (0xFF0000U)
#define ENETC_PSI_SICAPR0_NUM_RX_BDR_SHIFT       (16U)
#define ENETC_PSI_SICAPR0_NUM_RX_BDR_WIDTH       (8U)
#define ENETC_PSI_SICAPR0_NUM_RX_BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICAPR0_NUM_RX_BDR_SHIFT)) & ENETC_PSI_SICAPR0_NUM_RX_BDR_MASK)
/*! @} */

/*! @name SICAPR1 - Station interface capability register 1 */
/*! @{ */

#define ENETC_PSI_SICAPR1_NUM_RX_GRP_MASK        (0xFF0000U)
#define ENETC_PSI_SICAPR1_NUM_RX_GRP_SHIFT       (16U)
#define ENETC_PSI_SICAPR1_NUM_RX_GRP_WIDTH       (8U)
#define ENETC_PSI_SICAPR1_NUM_RX_GRP(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICAPR1_NUM_RX_GRP_SHIFT)) & ENETC_PSI_SICAPR1_NUM_RX_GRP_MASK)
/*! @} */

/*! @name SICAPR2 - Station interface capability register 2 */
/*! @{ */

#define ENETC_PSI_SICAPR2_VTP_MASK               (0xFU)
#define ENETC_PSI_SICAPR2_VTP_SHIFT              (0U)
#define ENETC_PSI_SICAPR2_VTP_WIDTH              (4U)
#define ENETC_PSI_SICAPR2_VTP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SICAPR2_VTP_SHIFT)) & ENETC_PSI_SICAPR2_VTP_MASK)
/*! @} */

/*! @name PSIIER - Physical station interface interrupt enable register */
/*! @{ */

#define ENETC_PSI_PSIIER_MR1IE_MASK              (0x2U)
#define ENETC_PSI_PSIIER_MR1IE_SHIFT             (1U)
#define ENETC_PSI_PSIIER_MR1IE_WIDTH             (1U)
#define ENETC_PSI_PSIIER_MR1IE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_MR1IE_SHIFT)) & ENETC_PSI_PSIIER_MR1IE_MASK)

#define ENETC_PSI_PSIIER_MR2IE_MASK              (0x4U)
#define ENETC_PSI_PSIIER_MR2IE_SHIFT             (2U)
#define ENETC_PSI_PSIIER_MR2IE_WIDTH             (1U)
#define ENETC_PSI_PSIIER_MR2IE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_MR2IE_SHIFT)) & ENETC_PSI_PSIIER_MR2IE_MASK)

#define ENETC_PSI_PSIIER_MR3IE_MASK              (0x8U)
#define ENETC_PSI_PSIIER_MR3IE_SHIFT             (3U)
#define ENETC_PSI_PSIIER_MR3IE_WIDTH             (1U)
#define ENETC_PSI_PSIIER_MR3IE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_MR3IE_SHIFT)) & ENETC_PSI_PSIIER_MR3IE_MASK)

#define ENETC_PSI_PSIIER_MR4IE_MASK              (0x10U)
#define ENETC_PSI_PSIIER_MR4IE_SHIFT             (4U)
#define ENETC_PSI_PSIIER_MR4IE_WIDTH             (1U)
#define ENETC_PSI_PSIIER_MR4IE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_MR4IE_SHIFT)) & ENETC_PSI_PSIIER_MR4IE_MASK)

#define ENETC_PSI_PSIIER_MR5IE_MASK              (0x20U)
#define ENETC_PSI_PSIIER_MR5IE_SHIFT             (5U)
#define ENETC_PSI_PSIIER_MR5IE_WIDTH             (1U)
#define ENETC_PSI_PSIIER_MR5IE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_MR5IE_SHIFT)) & ENETC_PSI_PSIIER_MR5IE_MASK)

#define ENETC_PSI_PSIIER_FLR1IE_MASK             (0x20000U)
#define ENETC_PSI_PSIIER_FLR1IE_SHIFT            (17U)
#define ENETC_PSI_PSIIER_FLR1IE_WIDTH            (1U)
#define ENETC_PSI_PSIIER_FLR1IE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_FLR1IE_SHIFT)) & ENETC_PSI_PSIIER_FLR1IE_MASK)

#define ENETC_PSI_PSIIER_FLR2IE_MASK             (0x40000U)
#define ENETC_PSI_PSIIER_FLR2IE_SHIFT            (18U)
#define ENETC_PSI_PSIIER_FLR2IE_WIDTH            (1U)
#define ENETC_PSI_PSIIER_FLR2IE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_FLR2IE_SHIFT)) & ENETC_PSI_PSIIER_FLR2IE_MASK)

#define ENETC_PSI_PSIIER_FLR3IE_MASK             (0x80000U)
#define ENETC_PSI_PSIIER_FLR3IE_SHIFT            (19U)
#define ENETC_PSI_PSIIER_FLR3IE_WIDTH            (1U)
#define ENETC_PSI_PSIIER_FLR3IE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_FLR3IE_SHIFT)) & ENETC_PSI_PSIIER_FLR3IE_MASK)

#define ENETC_PSI_PSIIER_FLR4IE_MASK             (0x100000U)
#define ENETC_PSI_PSIIER_FLR4IE_SHIFT            (20U)
#define ENETC_PSI_PSIIER_FLR4IE_WIDTH            (1U)
#define ENETC_PSI_PSIIER_FLR4IE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_FLR4IE_SHIFT)) & ENETC_PSI_PSIIER_FLR4IE_MASK)

#define ENETC_PSI_PSIIER_FLR5IE_MASK             (0x200000U)
#define ENETC_PSI_PSIIER_FLR5IE_SHIFT            (21U)
#define ENETC_PSI_PSIIER_FLR5IE_WIDTH            (1U)
#define ENETC_PSI_PSIIER_FLR5IE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIER_FLR5IE_SHIFT)) & ENETC_PSI_PSIIER_FLR5IE_MASK)
/*! @} */

/*! @name PSIIDR - Physical station interface interrupt detect register */
/*! @{ */

#define ENETC_PSI_PSIIDR_TXR_MASK                (0x1U)
#define ENETC_PSI_PSIIDR_TXR_SHIFT               (0U)
#define ENETC_PSI_PSIIDR_TXR_WIDTH               (1U)
#define ENETC_PSI_PSIIDR_TXR(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIDR_TXR_SHIFT)) & ENETC_PSI_PSIIDR_TXR_MASK)

#define ENETC_PSI_PSIIDR_MR1_MASK                (0x2U)
#define ENETC_PSI_PSIIDR_MR1_SHIFT               (1U)
#define ENETC_PSI_PSIIDR_MR1_WIDTH               (1U)
#define ENETC_PSI_PSIIDR_MR1(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIDR_MR1_SHIFT)) & ENETC_PSI_PSIIDR_MR1_MASK)

#define ENETC_PSI_PSIIDR_MR2_MASK                (0x4U)
#define ENETC_PSI_PSIIDR_MR2_SHIFT               (2U)
#define ENETC_PSI_PSIIDR_MR2_WIDTH               (1U)
#define ENETC_PSI_PSIIDR_MR2(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIDR_MR2_SHIFT)) & ENETC_PSI_PSIIDR_MR2_MASK)

#define ENETC_PSI_PSIIDR_MR3_MASK                (0x8U)
#define ENETC_PSI_PSIIDR_MR3_SHIFT               (3U)
#define ENETC_PSI_PSIIDR_MR3_WIDTH               (1U)
#define ENETC_PSI_PSIIDR_MR3(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIDR_MR3_SHIFT)) & ENETC_PSI_PSIIDR_MR3_MASK)

#define ENETC_PSI_PSIIDR_MR4_MASK                (0x10U)
#define ENETC_PSI_PSIIDR_MR4_SHIFT               (4U)
#define ENETC_PSI_PSIIDR_MR4_WIDTH               (1U)
#define ENETC_PSI_PSIIDR_MR4(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_PSIIDR_MR4_SHIFT)) & ENETC_PSI_PSIIDR_MR4_MASK)

