zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
#define ENETC_PSI_SITXIDR0_TXF2_MASK             (0x40000U)
#define ENETC_PSI_SITXIDR0_TXF2_SHIFT            (18U)
#define ENETC_PSI_SITXIDR0_TXF2_WIDTH            (1U)
#define ENETC_PSI_SITXIDR0_TXF2(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF2_SHIFT)) & ENETC_PSI_SITXIDR0_TXF2_MASK)

#define ENETC_PSI_SITXIDR0_TXF3_MASK             (0x80000U)
#define ENETC_PSI_SITXIDR0_TXF3_SHIFT            (19U)
#define ENETC_PSI_SITXIDR0_TXF3_WIDTH            (1U)
#define ENETC_PSI_SITXIDR0_TXF3(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF3_SHIFT)) & ENETC_PSI_SITXIDR0_TXF3_MASK)

#define ENETC_PSI_SITXIDR0_TXF4_MASK             (0x100000U)
#define ENETC_PSI_SITXIDR0_TXF4_SHIFT            (20U)
#define ENETC_PSI_SITXIDR0_TXF4_WIDTH            (1U)
#define ENETC_PSI_SITXIDR0_TXF4(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF4_SHIFT)) & ENETC_PSI_SITXIDR0_TXF4_MASK)

#define ENETC_PSI_SITXIDR0_TXF5_MASK             (0x200000U)
#define ENETC_PSI_SITXIDR0_TXF5_SHIFT            (21U)
#define ENETC_PSI_SITXIDR0_TXF5_WIDTH            (1U)
#define ENETC_PSI_SITXIDR0_TXF5(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF5_SHIFT)) & ENETC_PSI_SITXIDR0_TXF5_MASK)

#define ENETC_PSI_SITXIDR0_TXF6_MASK             (0x400000U)
#define ENETC_PSI_SITXIDR0_TXF6_SHIFT            (22U)
#define ENETC_PSI_SITXIDR0_TXF6_WIDTH            (1U)
#define ENETC_PSI_SITXIDR0_TXF6(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF6_SHIFT)) & ENETC_PSI_SITXIDR0_TXF6_MASK)

#define ENETC_PSI_SITXIDR0_TXF7_MASK             (0x800000U)
#define ENETC_PSI_SITXIDR0_TXF7_SHIFT            (23U)
#define ENETC_PSI_SITXIDR0_TXF7_WIDTH            (1U)
#define ENETC_PSI_SITXIDR0_TXF7(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF7_SHIFT)) & ENETC_PSI_SITXIDR0_TXF7_MASK)

#define ENETC_PSI_SITXIDR0_TXF8_MASK             (0x1000000U)
#define ENETC_PSI_SITXIDR0_TXF8_SHIFT            (24U)
#define ENETC_PSI_SITXIDR0_TXF8_WIDTH            (1U)
#define ENETC_PSI_SITXIDR0_TXF8(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF8_SHIFT)) & ENETC_PSI_SITXIDR0_TXF8_MASK)

#define ENETC_PSI_SITXIDR0_TXF9_MASK             (0x2000000U)
#define ENETC_PSI_SITXIDR0_TXF9_SHIFT            (25U)
#define ENETC_PSI_SITXIDR0_TXF9_WIDTH            (1U)
#define ENETC_PSI_SITXIDR0_TXF9(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF9_SHIFT)) & ENETC_PSI_SITXIDR0_TXF9_MASK)

#define ENETC_PSI_SITXIDR0_TXF10_MASK            (0x4000000U)
#define ENETC_PSI_SITXIDR0_TXF10_SHIFT           (26U)
#define ENETC_PSI_SITXIDR0_TXF10_WIDTH           (1U)
#define ENETC_PSI_SITXIDR0_TXF10(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF10_SHIFT)) & ENETC_PSI_SITXIDR0_TXF10_MASK)

#define ENETC_PSI_SITXIDR0_TXF11_MASK            (0x8000000U)
#define ENETC_PSI_SITXIDR0_TXF11_SHIFT           (27U)
#define ENETC_PSI_SITXIDR0_TXF11_WIDTH           (1U)
#define ENETC_PSI_SITXIDR0_TXF11(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF11_SHIFT)) & ENETC_PSI_SITXIDR0_TXF11_MASK)

#define ENETC_PSI_SITXIDR0_TXF12_MASK            (0x10000000U)
#define ENETC_PSI_SITXIDR0_TXF12_SHIFT           (28U)
#define ENETC_PSI_SITXIDR0_TXF12_WIDTH           (1U)
#define ENETC_PSI_SITXIDR0_TXF12(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF12_SHIFT)) & ENETC_PSI_SITXIDR0_TXF12_MASK)

#define ENETC_PSI_SITXIDR0_TXF13_MASK            (0x20000000U)
#define ENETC_PSI_SITXIDR0_TXF13_SHIFT           (29U)
#define ENETC_PSI_SITXIDR0_TXF13_WIDTH           (1U)
#define ENETC_PSI_SITXIDR0_TXF13(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SITXIDR0_TXF13_SHIFT)) & ENETC_PSI_SITXIDR0_TXF13_MASK)
/*! @} */

/*! @name SIRXIDR0 - Station interface receive interrupt detect register 0 */
/*! @{ */

#define ENETC_PSI_SIRXIDR0_RX0_MASK              (0x1U)
#define ENETC_PSI_SIRXIDR0_RX0_SHIFT             (0U)
#define ENETC_PSI_SIRXIDR0_RX0_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX0(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX0_SHIFT)) & ENETC_PSI_SIRXIDR0_RX0_MASK)

#define ENETC_PSI_SIRXIDR0_RX1_MASK              (0x2U)
#define ENETC_PSI_SIRXIDR0_RX1_SHIFT             (1U)
#define ENETC_PSI_SIRXIDR0_RX1_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX1(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX1_SHIFT)) & ENETC_PSI_SIRXIDR0_RX1_MASK)

#define ENETC_PSI_SIRXIDR0_RX2_MASK              (0x4U)
#define ENETC_PSI_SIRXIDR0_RX2_SHIFT             (2U)
#define ENETC_PSI_SIRXIDR0_RX2_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX2(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX2_SHIFT)) & ENETC_PSI_SIRXIDR0_RX2_MASK)

#define ENETC_PSI_SIRXIDR0_RX3_MASK              (0x8U)
#define ENETC_PSI_SIRXIDR0_RX3_SHIFT             (3U)
#define ENETC_PSI_SIRXIDR0_RX3_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX3(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX3_SHIFT)) & ENETC_PSI_SIRXIDR0_RX3_MASK)

#define ENETC_PSI_SIRXIDR0_RX4_MASK              (0x10U)
#define ENETC_PSI_SIRXIDR0_RX4_SHIFT             (4U)
#define ENETC_PSI_SIRXIDR0_RX4_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX4(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX4_SHIFT)) & ENETC_PSI_SIRXIDR0_RX4_MASK)

#define ENETC_PSI_SIRXIDR0_RX5_MASK              (0x20U)
#define ENETC_PSI_SIRXIDR0_RX5_SHIFT             (5U)
#define ENETC_PSI_SIRXIDR0_RX5_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX5(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX5_SHIFT)) & ENETC_PSI_SIRXIDR0_RX5_MASK)

#define ENETC_PSI_SIRXIDR0_RX6_MASK              (0x40U)
#define ENETC_PSI_SIRXIDR0_RX6_SHIFT             (6U)
#define ENETC_PSI_SIRXIDR0_RX6_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX6(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX6_SHIFT)) & ENETC_PSI_SIRXIDR0_RX6_MASK)

#define ENETC_PSI_SIRXIDR0_RX7_MASK              (0x80U)
#define ENETC_PSI_SIRXIDR0_RX7_SHIFT             (7U)
#define ENETC_PSI_SIRXIDR0_RX7_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX7(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX7_SHIFT)) & ENETC_PSI_SIRXIDR0_RX7_MASK)

#define ENETC_PSI_SIRXIDR0_RX8_MASK              (0x100U)
#define ENETC_PSI_SIRXIDR0_RX8_SHIFT             (8U)
#define ENETC_PSI_SIRXIDR0_RX8_WIDTH             (1U)
#define ENETC_PSI_SIRXIDR0_RX8(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRXIDR0_RX8_SHIFT)) & ENETC_PSI_SIRXIDR0_RX8_MASK)

