zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
#define ENETC_PSI_SIUPECR_RD_MASK                (0x80000000U)
#define ENETC_PSI_SIUPECR_RD_SHIFT               (31U)
#define ENETC_PSI_SIUPECR_RD_WIDTH               (1U)
#define ENETC_PSI_SIUPECR_RD(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUPECR_RD_SHIFT)) & ENETC_PSI_SIUPECR_RD_MASK)
/*! @} */

/*! @name SIUPESR - Station interface uncorrectable programming error status register */
/*! @{ */

#define ENETC_PSI_SIUPESR_DROP_SI_EN_MASK        (0x1U)
#define ENETC_PSI_SIUPESR_DROP_SI_EN_SHIFT       (0U)
#define ENETC_PSI_SIUPESR_DROP_SI_EN_WIDTH       (1U)
#define ENETC_PSI_SIUPESR_DROP_SI_EN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUPESR_DROP_SI_EN_SHIFT)) & ENETC_PSI_SIUPESR_DROP_SI_EN_MASK)

#define ENETC_PSI_SIUPESR_DROP_RING_EN_MASK      (0x2U)
#define ENETC_PSI_SIUPESR_DROP_RING_EN_SHIFT     (1U)
#define ENETC_PSI_SIUPESR_DROP_RING_EN_WIDTH     (1U)
#define ENETC_PSI_SIUPESR_DROP_RING_EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUPESR_DROP_RING_EN_SHIFT)) & ENETC_PSI_SIUPESR_DROP_RING_EN_MASK)

#define ENETC_PSI_SIUPESR_DROP_GRP_SEL_MASK      (0x4U)
#define ENETC_PSI_SIUPESR_DROP_GRP_SEL_SHIFT     (2U)
#define ENETC_PSI_SIUPESR_DROP_GRP_SEL_WIDTH     (1U)
#define ENETC_PSI_SIUPESR_DROP_GRP_SEL(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUPESR_DROP_GRP_SEL_SHIFT)) & ENETC_PSI_SIUPESR_DROP_GRP_SEL_MASK)

#define ENETC_PSI_SIUPESR_DROP_RING_SEL_MASK     (0x8U)
#define ENETC_PSI_SIUPESR_DROP_RING_SEL_SHIFT    (3U)
#define ENETC_PSI_SIUPESR_DROP_RING_SEL_WIDTH    (1U)
#define ENETC_PSI_SIUPESR_DROP_RING_SEL(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUPESR_DROP_RING_SEL_SHIFT)) & ENETC_PSI_SIUPESR_DROP_RING_SEL_MASK)

#define ENETC_PSI_SIUPESR_M_MASK                 (0x40000000U)
#define ENETC_PSI_SIUPESR_M_SHIFT                (30U)
#define ENETC_PSI_SIUPESR_M_WIDTH                (1U)
#define ENETC_PSI_SIUPESR_M(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUPESR_M_SHIFT)) & ENETC_PSI_SIUPESR_M_MASK)

#define ENETC_PSI_SIUPESR_PE_MASK                (0x80000000U)
#define ENETC_PSI_SIUPESR_PE_SHIFT               (31U)
#define ENETC_PSI_SIUPESR_PE_WIDTH               (1U)
#define ENETC_PSI_SIUPESR_PE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUPESR_PE_SHIFT)) & ENETC_PSI_SIUPESR_PE_MASK)
/*! @} */

/*! @name SIUPECTR - Station interface uncorrectable programming error count register */
/*! @{ */

#define ENETC_PSI_SIUPECTR_COUNT_MASK            (0xFFFFFFFFU)
#define ENETC_PSI_SIUPECTR_COUNT_SHIFT           (0U)
#define ENETC_PSI_SIUPECTR_COUNT_WIDTH           (32U)
#define ENETC_PSI_SIUPECTR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUPECTR_COUNT_SHIFT)) & ENETC_PSI_SIUPECTR_COUNT_MASK)
/*! @} */

/*! @name SIUNSBECR - Station interface uncorrectable non-fatal system bus error configuration register */
/*! @{ */

#define ENETC_PSI_SIUNSBECR_THRESHOLD_MASK       (0xFFU)
#define ENETC_PSI_SIUNSBECR_THRESHOLD_SHIFT      (0U)
#define ENETC_PSI_SIUNSBECR_THRESHOLD_WIDTH      (8U)
#define ENETC_PSI_SIUNSBECR_THRESHOLD(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNSBECR_THRESHOLD_SHIFT)) & ENETC_PSI_SIUNSBECR_THRESHOLD_MASK)
/*! @} */

/*! @name SIUNSBESR - Station interface uncorrectable non-fatal system bus error status register */
/*! @{ */

#define ENETC_PSI_SIUNSBESR_SB_ID_MASK           (0xF00U)
#define ENETC_PSI_SIUNSBESR_SB_ID_SHIFT          (8U)
#define ENETC_PSI_SIUNSBESR_SB_ID_WIDTH          (4U)
#define ENETC_PSI_SIUNSBESR_SB_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNSBESR_SB_ID_SHIFT)) & ENETC_PSI_SIUNSBESR_SB_ID_MASK)

#define ENETC_PSI_SIUNSBESR_SBE_MASK             (0x80000000U)
#define ENETC_PSI_SIUNSBESR_SBE_SHIFT            (31U)
#define ENETC_PSI_SIUNSBESR_SBE_WIDTH            (1U)
#define ENETC_PSI_SIUNSBESR_SBE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNSBESR_SBE_SHIFT)) & ENETC_PSI_SIUNSBESR_SBE_MASK)
/*! @} */

/*! @name SIUNSBECTR - Station interface uncorrectable non-fatal system bus error count register */
/*! @{ */

#define ENETC_PSI_SIUNSBECTR_COUNT_MASK          (0xFFU)
#define ENETC_PSI_SIUNSBECTR_COUNT_SHIFT         (0U)
#define ENETC_PSI_SIUNSBECTR_COUNT_WIDTH         (8U)
#define ENETC_PSI_SIUNSBECTR_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNSBECTR_COUNT_SHIFT)) & ENETC_PSI_SIUNSBECTR_COUNT_MASK)
/*! @} */

/*! @name SIUFSBECR - Station interface uncorrectable fatal system bus error configuration register */
/*! @{ */

#define ENETC_PSI_SIUFSBECR_RD_MASK              (0x80000000U)
#define ENETC_PSI_SIUFSBECR_RD_SHIFT             (31U)
#define ENETC_PSI_SIUFSBECR_RD_WIDTH             (1U)
#define ENETC_PSI_SIUFSBECR_RD(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUFSBECR_RD_SHIFT)) & ENETC_PSI_SIUFSBECR_RD_MASK)
/*! @} */

/*! @name SIUFSBESR - Station interface uncorrectable fatal system bus error status register */
/*! @{ */

#define ENETC_PSI_SIUFSBESR_SB_ID_MASK           (0xF00U)
#define ENETC_PSI_SIUFSBESR_SB_ID_SHIFT          (8U)
#define ENETC_PSI_SIUFSBESR_SB_ID_WIDTH          (4U)
#define ENETC_PSI_SIUFSBESR_SB_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUFSBESR_SB_ID_SHIFT)) & ENETC_PSI_SIUFSBESR_SB_ID_MASK)

#define ENETC_PSI_SIUFSBESR_M_MASK               (0x40000000U)
#define ENETC_PSI_SIUFSBESR_M_SHIFT              (30U)
#define ENETC_PSI_SIUFSBESR_M_WIDTH              (1U)
#define ENETC_PSI_SIUFSBESR_M(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUFSBESR_M_SHIFT)) & ENETC_PSI_SIUFSBESR_M_MASK)

#define ENETC_PSI_SIUFSBESR_SBE_MASK             (0x80000000U)
#define ENETC_PSI_SIUFSBESR_SBE_SHIFT            (31U)
#define ENETC_PSI_SIUFSBESR_SBE_WIDTH            (1U)
#define ENETC_PSI_SIUFSBESR_SBE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUFSBESR_SBE_SHIFT)) & ENETC_PSI_SIUFSBESR_SBE_MASK)
/*! @} */

/*! @name SIUNMECR - Station interface uncorrectable non-fatal memory error configuration register */
/*! @{ */

#define ENETC_PSI_SIUNMECR_THRESHOLD_MASK        (0xFFU)
#define ENETC_PSI_SIUNMECR_THRESHOLD_SHIFT       (0U)
#define ENETC_PSI_SIUNMECR_THRESHOLD_WIDTH       (8U)
#define ENETC_PSI_SIUNMECR_THRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNMECR_THRESHOLD_SHIFT)) & ENETC_PSI_SIUNMECR_THRESHOLD_MASK)

#define ENETC_PSI_SIUNMECR_RD_MASK               (0x80000000U)
#define ENETC_PSI_SIUNMECR_RD_SHIFT              (31U)
#define ENETC_PSI_SIUNMECR_RD_WIDTH              (1U)
#define ENETC_PSI_SIUNMECR_RD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNMECR_RD_SHIFT)) & ENETC_PSI_SIUNMECR_RD_MASK)
/*! @} */

/*! @name SIUNMESR0 - Station interface uncorrectable non-fatal memory error status register 0 */
/*! @{ */

#define ENETC_PSI_SIUNMESR0_MEM_ID_MASK          (0x1F00U)
#define ENETC_PSI_SIUNMESR0_MEM_ID_SHIFT         (8U)
#define ENETC_PSI_SIUNMESR0_MEM_ID_WIDTH         (5U)
#define ENETC_PSI_SIUNMESR0_MEM_ID(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNMESR0_MEM_ID_SHIFT)) & ENETC_PSI_SIUNMESR0_MEM_ID_MASK)

#define ENETC_PSI_SIUNMESR0_SYNDROME_MASK        (0x7FF0000U)
#define ENETC_PSI_SIUNMESR0_SYNDROME_SHIFT       (16U)
#define ENETC_PSI_SIUNMESR0_SYNDROME_WIDTH       (11U)
#define ENETC_PSI_SIUNMESR0_SYNDROME(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNMESR0_SYNDROME_SHIFT)) & ENETC_PSI_SIUNMESR0_SYNDROME_MASK)

#define ENETC_PSI_SIUNMESR0_MBEE_MASK            (0x80000000U)
#define ENETC_PSI_SIUNMESR0_MBEE_SHIFT           (31U)
#define ENETC_PSI_SIUNMESR0_MBEE_WIDTH           (1U)
#define ENETC_PSI_SIUNMESR0_MBEE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNMESR0_MBEE_SHIFT)) & ENETC_PSI_SIUNMESR0_MBEE_MASK)
/*! @} */

/*! @name SIUNMESR1 - Station interface uncorrectable non-fatal memory error status register 1 */
/*! @{ */

#define ENETC_PSI_SIUNMESR1_ADDR_MASK            (0xFFFFFFFFU)
#define ENETC_PSI_SIUNMESR1_ADDR_SHIFT           (0U)
#define ENETC_PSI_SIUNMESR1_ADDR_WIDTH           (32U)
#define ENETC_PSI_SIUNMESR1_ADDR(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNMESR1_ADDR_SHIFT)) & ENETC_PSI_SIUNMESR1_ADDR_MASK)
/*! @} */

/*! @name SIUNMECTR - Station interface uncorrectable non-fatal memory error count register */
/*! @{ */

#define ENETC_PSI_SIUNMECTR_COUNT_MASK           (0xFFU)
#define ENETC_PSI_SIUNMECTR_COUNT_SHIFT          (0U)
#define ENETC_PSI_SIUNMECTR_COUNT_WIDTH          (8U)
#define ENETC_PSI_SIUNMECTR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIUNMECTR_COUNT_SHIFT)) & ENETC_PSI_SIUNMECTR_COUNT_MASK)
/*! @} */

