zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
/*! @name SIRFSCAPR - Station interface RFS capability register */
/*! @{ */

#define ENETC_PSI_SIRFSCAPR_NUM_RFS_MASK         (0x1FFU)
#define ENETC_PSI_SIRFSCAPR_NUM_RFS_SHIFT        (0U)
#define ENETC_PSI_SIRFSCAPR_NUM_RFS_WIDTH        (9U)
#define ENETC_PSI_SIRFSCAPR_NUM_RFS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRFSCAPR_NUM_RFS_SHIFT)) & ENETC_PSI_SIRFSCAPR_NUM_RFS_MASK)

#define ENETC_PSI_SIRFSCAPR_VERSIONS_MASK        (0xFFFF0000U)
#define ENETC_PSI_SIRFSCAPR_VERSIONS_SHIFT       (16U)
#define ENETC_PSI_SIRFSCAPR_VERSIONS_WIDTH       (16U)
#define ENETC_PSI_SIRFSCAPR_VERSIONS(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_SIRFSCAPR_VERSIONS_SHIFT)) & ENETC_PSI_SIRFSCAPR_VERSIONS_MASK)
/*! @} */

/*! @name TBMR - Tx BDR 0 mode register..Tx BDR 13 mode register */
/*! @{ */

#define ENETC_PSI_TBMR_PRIO_MASK                 (0x7U)
#define ENETC_PSI_TBMR_PRIO_SHIFT                (0U)
#define ENETC_PSI_TBMR_PRIO_WIDTH                (3U)
#define ENETC_PSI_TBMR_PRIO(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBMR_PRIO_SHIFT)) & ENETC_PSI_TBMR_PRIO_MASK)

#define ENETC_PSI_TBMR_WRR_MASK                  (0x70U)
#define ENETC_PSI_TBMR_WRR_SHIFT                 (4U)
#define ENETC_PSI_TBMR_WRR_WIDTH                 (3U)
#define ENETC_PSI_TBMR_WRR(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBMR_WRR_SHIFT)) & ENETC_PSI_TBMR_WRR_MASK)

#define ENETC_PSI_TBMR_CRC_MASK                  (0x100U)
#define ENETC_PSI_TBMR_CRC_SHIFT                 (8U)
#define ENETC_PSI_TBMR_CRC_WIDTH                 (1U)
#define ENETC_PSI_TBMR_CRC(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBMR_CRC_SHIFT)) & ENETC_PSI_TBMR_CRC_MASK)

#define ENETC_PSI_TBMR_VIH_MASK                  (0x200U)
#define ENETC_PSI_TBMR_VIH_SHIFT                 (9U)
#define ENETC_PSI_TBMR_VIH_WIDTH                 (1U)
#define ENETC_PSI_TBMR_VIH(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBMR_VIH_SHIFT)) & ENETC_PSI_TBMR_VIH_MASK)

#define ENETC_PSI_TBMR_FWB_MASK                  (0x1000000U)
#define ENETC_PSI_TBMR_FWB_SHIFT                 (24U)
#define ENETC_PSI_TBMR_FWB_WIDTH                 (1U)
#define ENETC_PSI_TBMR_FWB(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBMR_FWB_SHIFT)) & ENETC_PSI_TBMR_FWB_MASK)

#define ENETC_PSI_TBMR_EN_MASK                   (0x80000000U)
#define ENETC_PSI_TBMR_EN_SHIFT                  (31U)
#define ENETC_PSI_TBMR_EN_WIDTH                  (1U)
#define ENETC_PSI_TBMR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBMR_EN_SHIFT)) & ENETC_PSI_TBMR_EN_MASK)
/*! @} */

/*! @name TBSR - Tx BDR 0 status register..Tx BDR 13 status register */
/*! @{ */

#define ENETC_PSI_TBSR_BUSY_MASK                 (0x1U)
#define ENETC_PSI_TBSR_BUSY_SHIFT                (0U)
#define ENETC_PSI_TBSR_BUSY_WIDTH                (1U)
#define ENETC_PSI_TBSR_BUSY(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBSR_BUSY_SHIFT)) & ENETC_PSI_TBSR_BUSY_MASK)

#define ENETC_PSI_TBSR_SBE_MASK                  (0x10000U)
#define ENETC_PSI_TBSR_SBE_SHIFT                 (16U)
#define ENETC_PSI_TBSR_SBE_WIDTH                 (1U)
#define ENETC_PSI_TBSR_SBE(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBSR_SBE_SHIFT)) & ENETC_PSI_TBSR_SBE_MASK)
/*! @} */

/*! @name TBBAR0 - Tx BDR 0 base address register 0..Tx BDR 13 base address register 0 */
/*! @{ */

#define ENETC_PSI_TBBAR0_ADDRL_MASK              (0xFFFFFF80U)
#define ENETC_PSI_TBBAR0_ADDRL_SHIFT             (7U)
#define ENETC_PSI_TBBAR0_ADDRL_WIDTH             (25U)
#define ENETC_PSI_TBBAR0_ADDRL(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBBAR0_ADDRL_SHIFT)) & ENETC_PSI_TBBAR0_ADDRL_MASK)
/*! @} */

/*! @name TBBAR1 - Tx BDR 0 base address register 1..Tx BDR 13 base address register 1 */
/*! @{ */

#define ENETC_PSI_TBBAR1_ADDRH_MASK              (0xFFFFFFFFU)
#define ENETC_PSI_TBBAR1_ADDRH_SHIFT             (0U)
#define ENETC_PSI_TBBAR1_ADDRH_WIDTH             (32U)
#define ENETC_PSI_TBBAR1_ADDRH(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBBAR1_ADDRH_SHIFT)) & ENETC_PSI_TBBAR1_ADDRH_MASK)
/*! @} */

/*! @name TBPIR - Tx BDR 0 producer index register..Tx BDR 13 producer index register */
/*! @{ */

#define ENETC_PSI_TBPIR_BDR_INDEX_MASK           (0xFFFFU)
#define ENETC_PSI_TBPIR_BDR_INDEX_SHIFT          (0U)
#define ENETC_PSI_TBPIR_BDR_INDEX_WIDTH          (16U)
#define ENETC_PSI_TBPIR_BDR_INDEX(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBPIR_BDR_INDEX_SHIFT)) & ENETC_PSI_TBPIR_BDR_INDEX_MASK)
/*! @} */

/*! @name TBCIR - Tx BDR 0 consumer index register..Tx BDR 13 consumer index register */
/*! @{ */

#define ENETC_PSI_TBCIR_BDR_INDEX_MASK           (0xFFFFU)
#define ENETC_PSI_TBCIR_BDR_INDEX_SHIFT          (0U)
#define ENETC_PSI_TBCIR_BDR_INDEX_WIDTH          (16U)
#define ENETC_PSI_TBCIR_BDR_INDEX(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBCIR_BDR_INDEX_SHIFT)) & ENETC_PSI_TBCIR_BDR_INDEX_MASK)

#define ENETC_PSI_TBCIR_STAT_ID_MASK             (0x7FFF0000U)
#define ENETC_PSI_TBCIR_STAT_ID_SHIFT            (16U)
#define ENETC_PSI_TBCIR_STAT_ID_WIDTH            (15U)
#define ENETC_PSI_TBCIR_STAT_ID(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBCIR_STAT_ID_SHIFT)) & ENETC_PSI_TBCIR_STAT_ID_MASK)

#define ENETC_PSI_TBCIR_SBE_MASK                 (0x80000000U)
#define ENETC_PSI_TBCIR_SBE_SHIFT                (31U)
#define ENETC_PSI_TBCIR_SBE_WIDTH                (1U)
#define ENETC_PSI_TBCIR_SBE(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBCIR_SBE_SHIFT)) & ENETC_PSI_TBCIR_SBE_MASK)
/*! @} */

/*! @name TBLENR - Tx BDR 0 length register..Tx BDR 13 length register */
/*! @{ */

#define ENETC_PSI_TBLENR_LENGTH_MASK             (0x1FFF8U)
#define ENETC_PSI_TBLENR_LENGTH_SHIFT            (3U)
#define ENETC_PSI_TBLENR_LENGTH_WIDTH            (14U)
#define ENETC_PSI_TBLENR_LENGTH(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_TBLENR_LENGTH_SHIFT)) & ENETC_PSI_TBLENR_LENGTH_MASK)
/*! @} */

