zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PSI.h
#define ENETC_PSI_RBPIR_SBE_MASK                 (0x80000000U)
#define ENETC_PSI_RBPIR_SBE_SHIFT                (31U)
#define ENETC_PSI_RBPIR_SBE_WIDTH                (1U)
#define ENETC_PSI_RBPIR_SBE(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_RBPIR_SBE_SHIFT)) & ENETC_PSI_RBPIR_SBE_MASK)
/*! @} */

/*! @name RBLENR - Rx BDR 0 length register..Rx BDR 13 length register */
/*! @{ */

#define ENETC_PSI_RBLENR_LENGTH_MASK             (0x1FFF8U)
#define ENETC_PSI_RBLENR_LENGTH_SHIFT            (3U)
#define ENETC_PSI_RBLENR_LENGTH_WIDTH            (14U)
#define ENETC_PSI_RBLENR_LENGTH(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_RBLENR_LENGTH_SHIFT)) & ENETC_PSI_RBLENR_LENGTH_MASK)
/*! @} */

/*! @name RBDCR - Rx BDR 0 drop count register..Rx BDR 13 drop count register */
/*! @{ */

#define ENETC_PSI_RBDCR_COUNT_MASK               (0xFFFFFFFFU)
#define ENETC_PSI_RBDCR_COUNT_SHIFT              (0U)
#define ENETC_PSI_RBDCR_COUNT_WIDTH              (32U)
#define ENETC_PSI_RBDCR_COUNT(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_RBDCR_COUNT_SHIFT)) & ENETC_PSI_RBDCR_COUNT_MASK)
/*! @} */

/*! @name RBIER - Rx BDR 0 interrupt enable register..Rx BDR 13 interrupt enable register */
/*! @{ */

#define ENETC_PSI_RBIER_RXTIE_MASK               (0x1U)
#define ENETC_PSI_RBIER_RXTIE_SHIFT              (0U)
#define ENETC_PSI_RBIER_RXTIE_WIDTH              (1U)
#define ENETC_PSI_RBIER_RXTIE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_RBIER_RXTIE_SHIFT)) & ENETC_PSI_RBIER_RXTIE_MASK)
/*! @} */

/*! @name RBIDR - Rx BDR 0 interrupt detect register..Rx BDR 13 interrupt detect register */
/*! @{ */

#define ENETC_PSI_RBIDR_RXT_MASK                 (0x1U)
#define ENETC_PSI_RBIDR_RXT_SHIFT                (0U)
#define ENETC_PSI_RBIDR_RXT_WIDTH                (1U)
#define ENETC_PSI_RBIDR_RXT(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_RBIDR_RXT_SHIFT)) & ENETC_PSI_RBIDR_RXT_MASK)
/*! @} */

/*! @name RBICR0 - Rx BDR 0 interrupt coalescing register 0..Rx BDR 13 interrupt coalescing register 0 */
/*! @{ */

#define ENETC_PSI_RBICR0_ICPT_MASK               (0x1FFU)
#define ENETC_PSI_RBICR0_ICPT_SHIFT              (0U)
#define ENETC_PSI_RBICR0_ICPT_WIDTH              (9U)
#define ENETC_PSI_RBICR0_ICPT(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_RBICR0_ICPT_SHIFT)) & ENETC_PSI_RBICR0_ICPT_MASK)

#define ENETC_PSI_RBICR0_ICEN_MASK               (0x80000000U)
#define ENETC_PSI_RBICR0_ICEN_SHIFT              (31U)
#define ENETC_PSI_RBICR0_ICEN_WIDTH              (1U)
#define ENETC_PSI_RBICR0_ICEN(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_RBICR0_ICEN_SHIFT)) & ENETC_PSI_RBICR0_ICEN_MASK)
/*! @} */

/*! @name RBICR1 - Rx BDR 0 interrupt coalescing register 1..Rx BDR 13 interrupt coalescing register 1 */
/*! @{ */

#define ENETC_PSI_RBICR1_ICTT_MASK               (0xFFFFFFFFU)
#define ENETC_PSI_RBICR1_ICTT_SHIFT              (0U)
#define ENETC_PSI_RBICR1_ICTT_WIDTH              (32U)
#define ENETC_PSI_RBICR1_ICTT(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PSI_RBICR1_ICTT_SHIFT)) & ENETC_PSI_RBICR1_ICTT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ENETC_PSI_Register_Masks */

/*!
 * @}
 */ /* end of group ENETC_PSI_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_ENETC_PSI_H_) */
